# St7GetSRABaseCaseTable

Returns the table associated with the specified Spectral Response analysis Base Excitation case.

long St7GetSRABaseCaseTable(long uID, long SRACase, long* TableID)

Input Parameters

uID

Strand7 model file ID.

SRACase

Spectral Response base excitation case number.

Output Parameters

TableID

Table ID number, or 0 for none.

Strand7 API Manual